Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/irish_constitution_1/main_institutions_of_the_state.html.txt.tmx
Source language: en
Languages: ga

source: Main institutions of the State
ga: Príomh institiúidí an Stáit

source: The Irish Constitution establishes and describes the main institutions of the State
ga: Bunaíonn Bunreacht na hÉireann príomh institiúidí Stáit na hÉireann agus déanann an Bunreacht cur síos orthu

source: The power to run the State is divided into 3 separate powers: the legislative power, the executive power, and the judicial power
ga: Tá 3 roinn dhifriúil sa chumhacht chun an stáit a rialú, an chumhacht reachtais, an chumhacht fheidhmeannaigh agus an chumhacht dlíthiúil

source: The legislative power is the power to make laws, that is, to introduce, remove or change legislation
ga: Tá an deis chun dlíthe a dhéanamh ag an gcumhacht reachtais, mar shampla, chun reachtaíocht a chuir i bhfeidhm, é a chuir ar ceal nó chun athrú a dhéanamh ar an reachtaíocht

source: Articles 15 to 27 of the Constitution give this power to the national parliament or the Oireachtas
ga: Tugann Airteagal 15 go dtí Airteagal 27 den Bhunreacht an chumhacht seo don pharlaimint náisiúnta nó don Oireachtas

source: The Oireachtas consists of Dáil Éireann, Seanad Éireann and the President
ga: Tá Dáil Éireann, Seanad Éireann agus an tUachtarán mar chuid den Oireachtas

source: The executive power is the power to carry the laws into effect, that is, to execute or carry out the laws with the assistance of a police force, a military force and the civil service
ga: Tá an chumhacht chun an dlí a chuir i bhfeidhm ag an gcumhacht reachtais, mar shampla, na reachtais a chuir i bhfeidhm le cabhair ó na Gardaí, ón arm agus ó na stáit seirbhísigh

source: Article 28 of the Constitution gives this power to the Government, that is. the Taoiseach, the Tanaiste and the cabinet of Ministers
ga: Tugann Airteagal 28 den Bhunreacht an chumhacht seo don Rialtas, 'sé sin, an Taoiseach, an Tánaiste agus baill den rialtas na hAirí Rialtais

source: The judicial power is the power to interpret and apply the law to disputes and conflicts that arise between the State and the individual and disputes and conflicts that arise between individuals
ga: Sa chumhacht dlíthiúil tá an chumhacht atá ag na cúirteanna chun an dlí a aithint agus a chuir i bhfeidhm in aon chonspóid idir an duine aonar agus an Stát agus in aon chonspóid idir aon bheirt daoine

source: Articles 34 to 37 of the Constitution give this power to the courts
ga: Tugann Airteagal 34 go dtí 37 de Bhunreacht na hÉireann an chumhacht seo do na Cúirteanna

source: The Constitution describes the office and the role of the Council of State, the Comptroller and Auditor General and the Attorney General
ga: Déanann an Bunreacht, freisin, cur síos agus míniú a thabhairt ar ról An Chomhairle Stáit, ar ról an Ard-Reachtaire Cúntas agus Ciste agus ar ról An Ard-Aighne

source: The Constitution also provides for local government and addresses the issue of international relations
ga: Tugann an Bunreacht deis chun rialtas áitiúil a chuir i bhfeidhm agus déanann sé socrú chun caidreamh idirnáisiúnta a lámhsáil
